src/cf/InformationRegisters/ПоследовательностьПартийДляКУДиР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПоследовательностьПартийДляКУДиР</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НарушенПорядок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоМесяца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ПоследовательностьПартийДляКУДиР/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьДатуГраницыДляОрганизации(пОрганизация) Экспорт
	
	Если Не ЗначениеЗаполнено(пОрганизация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ПоследовательностьПартийДляКУДиР.НачалоМесяца) КАК НачалоМесяца
		|ИЗ
		|	РегистрСведений.ПоследовательностьПартийДляКУДиР КАК ПоследовательностьПартийДляКУДиР
		|ГДЕ
		|	ПоследовательностьПартийДляКУДиР.Организация = &пОрганизация";
	
	Запрос.УстановитьПараметр("пОрганизация", пОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НачалоМесяца;
	Иначе
		// Нет записей по организации, значит, нет необходимости восстанавливать по ней последовательность.
		// При добавлении организации запись в регистре не создается, т.к. она не нужна.
		// Запись добавляется при записи документа, который входит в последовательность.
		// Если по организации нет документов, то нет необходимости рассчитывать партии для КУДиР.
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Самая ранняя дата по всем организациям, с которой нужно восстановить движения по партиям.
// Учитываются только организации - ИП с включенной сдачей отчетности
// 
// Возвращаемое значение:
//   - Дата, Неопределено
//
Функция ПолучитьДатуГраницыОбщую() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ПоследовательностьПартийДляКУДиР.НачалоМесяца) КАК НачалоМесяца
		|ИЗ
		|	РегистрСведений.ПоследовательностьПартийДляКУДиР КАК ПоследовательностьПартийДляКУДиР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ПоследовательностьПартийДляКУДиР.Организация = Организации.Ссылка
		|			И (Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо))
		|			И (Организации.ИспользуетсяОтчетность)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НачалоМесяца;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
